<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"c718e909ce1d46bb6299248c3444540922ada22afbdca1d5b18e9ea3b1ff4c0e","plan_job_ref":"Job Tests for PRs #241 at https://github.com/GSA-TTS/FAC/actions/runs/4940546814","plan_hash":"ac0765c32c3c36239c8c892cda86dd21408f67d7f177584ce1e25fbcaeef8e90","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 13 to add, 2 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.production.cloudfoundry_app.postgrest will be created
  + resource "cloudfoundry_app" "postgrest" {
      + buildpack                       = (known after apply)
      + disk_quota                      = 256
      + docker_image                    = "postgrest/postgrest:v10.1.2"
      + enable_ssh                      = (known after apply)
      + environment                     = (sensitive value)
      + health_check_http_endpoint      = (known after apply)
      + health_check_invocation_timeout = (known after apply)
      + health_check_timeout            = (known after apply)
      + health_check_type               = "port"
      + id                              = (known after apply)
      + id_bg                           = (known after apply)
      + instances                       = 2
      + memory                          = 128
      + name                            = "postgrest"
      + ports                           = (known after apply)
      + space                           = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
      + stack                           = (known after apply)
      + stopped                         = false
      + strategy                        = "rolling"
      + timeout                         = 180

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }
    }

  # module.production.cloudfoundry_app.swagger will be created
  + resource "cloudfoundry_app" "swagger" {
      + buildpack                       = (known after apply)
      + disk_quota                      = 256
      + docker_image                    = "swaggerapi/swagger-ui"
      + enable_ssh                      = (known after apply)
      + environment                     = (sensitive value)
      + health_check_http_endpoint      = (known after apply)
      + health_check_invocation_timeout = (known after apply)
      + health_check_timeout            = (known after apply)
      + health_check_type               = "process"
      + id                              = (known after apply)
      + id_bg                           = (known after apply)
      + instances                       = 2
      + memory                          = 256
      + name                            = "swagger"
      + ports                           = (known after apply)
      + space                           = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
      + stack                           = (known after apply)
      + stopped                         = false
      + strategy                        = "rolling"
      + timeout                         = 20

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }
    }

  # module.production.cloudfoundry_route.postgrest will be created
  + resource "cloudfoundry_route" "postgrest" {
      + domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
      + endpoint = (known after apply)
      + hostname = "fac-production-postgrest"
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
    }

  # module.production.cloudfoundry_route.swagger will be created
  + resource "cloudfoundry_route" "swagger" {
      + domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
      + endpoint = (known after apply)
      + hostname = "fac-production-swagger"
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
    }

  # module.production.cloudfoundry_service_key.postgrest will be created
  + resource "cloudfoundry_service_key" "postgrest" {
      + credentials      = (sensitive value)
      + id               = (known after apply)
      + name             = "postgrest"
      + service_instance = "727f571b-3ebc-45d1-b2a8-ed1196ecfdd9"
    }

  # module.production.cloudfoundry_user_provided_service.credentials will be created
  + resource "cloudfoundry_user_provided_service" "credentials" {
      + credentials = (sensitive value)
      + id          = (known after apply)
      + name        = "newrelic-creds"
      + space       = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
    }

  # module.production.module.clamav.cloudfoundry_app.clamav_api will be updated in-place
  ~ resource "cloudfoundry_app" "clamav_api" {
      ~ environment                     = (sensitive value)
        id                              = "5d0afa4f-527b-472a-8671-79a60335417f"
      ~ id_bg                           = "************************************" -> (known after apply)
      ~ instances                       = 0 -> 1
        name                            = "fac-av-production"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.production.module.clamav.cloudfoundry_network_policy.clamav_routing will be updated in-place
  ~ resource "cloudfoundry_network_policy" "clamav_routing" {
        id = "b3610c24-5147-4714-9f2f-a53445f9dbca"

      - policy {
          - destination_app = "5d0afa4f-527b-472a-8671-79a60335417f" -> null
          - port            = "61443" -> null
          - protocol        = "tcp" -> null
          - source_app      = "5dac166f-2fb0-4e72-8d4d-4359191bf284" -> null
        }
      + policy {
          + destination_app = (known after apply)
          + port            = "61443"
          + protocol        = "tcp"
          + source_app      = "5dac166f-2fb0-4e72-8d4d-4359191bf284"
        }
    }

  # module.production.module.egress-proxy.cloudfoundry_app.egress_app will be created
  + resource "cloudfoundry_app" "egress_app" {
      + buildpack                       = "binary_buildpack"
      + command                         = "./caddy run --config Caddyfile"
      + disk_quota                      = (known after apply)
      + enable_ssh                      = (known after apply)
      + environment                     = (sensitive value)
      + health_check_http_endpoint      = (known after apply)
      + health_check_invocation_timeout = (known after apply)
      + health_check_timeout            = (known after apply)
      + health_check_type               = "port"
      + id                              = (known after apply)
      + id_bg                           = (known after apply)
      + instances                       = 2
      + memory                          = 64
      + name                            = "egress"
      + path                            = "../shared/modules/egress-proxy/proxy.zip"
      + ports                           = (known after apply)
      + source_code_hash                = "cfddd8df06cdb61c6b5a5fe8b879a9ad5b8eeb0752a9f7d73bf4ae050184e237"
      + space                           = "2aaa890e-eda6-4c58-bf21-216d9ef1e901"
      + stack                           = (known after apply)
      + stopped                         = false
      + strategy                        = "rolling"
      + timeout                         = 60

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }
    }

  # module.production.module.egress-proxy.cloudfoundry_network_policy.client_routing["fac-av-production"] will be created
  + resource "cloudfoundry_network_policy" "client_routing" {
      + id = (known after apply)

      + policy {
          + destination_app = (known after apply)
          + port            = "61443"
          + protocol        = "tcp"
          + source_app      = "5d0afa4f-527b-472a-8671-79a60335417f"
        }
    }

  # module.production.module.egress-proxy.cloudfoundry_network_policy.client_routing["gsa-fac"] will be created
  + resource "cloudfoundry_network_policy" "client_routing" {
      + id = (known after apply)

      + policy {
          + destination_app = (known after apply)
          + port            = "61443"
          + protocol        = "tcp"
          + source_app      = "5dac166f-2fb0-4e72-8d4d-4359191bf284"
        }
    }

  # module.production.module.egress-proxy.cloudfoundry_route.egress_route will be created
  + resource "cloudfoundry_route" "egress_route" {
      + domain   = "26df58ef-0c0d-4997-b68b-8defb7b3998b"
      + endpoint = (known after apply)
      + hostname = "gsa-tts-oros-fac-production-egress-egress"
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "2aaa890e-eda6-4c58-bf21-216d9ef1e901"
    }

  # module.production.module.egress-proxy.cloudfoundry_user_provided_service.credentials will be created
  + resource "cloudfoundry_user_provided_service" "credentials" {
      + credentials = (sensitive value)
      + id          = (known after apply)
      + name        = "egress-creds"
      + space       = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
    }

  # module.production.module.egress-proxy.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.production.module.egress-proxy.random_uuid.username will be created
  + resource "random_uuid" "username" {
      + id     = (known after apply)
      + result = (known after apply)
    }

Plan: 13 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Tests for PRs #241](https://github.com/GSA-TTS/FAC/actions/runs/4940546814)